
import re
# Написати валідації за допомогою регулярних виразів:
# - домашній номер телефону (тільки цифри та довжина номера)
# ^\d{7}$ #(5135826 - без розбиття рисочками)
# ^\d{3}[-]\d{2}[-]\d{2}$ #(513-58-26 - з розбиттям рисочками)
# result = re.findall(r"\d{7}", '51358264, 512s826, 5125825')
# print(result)
#
# - Мобільний номер телефону (тільки цифри, можлива наявність плюса, довжина номера)
# ^[+]?[380]{3}\d{9}$ #(380678456578 - без розбиття рисочками)
# ^[+]?[380]\d{3}[-]\d{2}[-]\d{2}$ #(+380-63-687-78-95 - з розбиттям рисочками)
# result = re.findall(r"[+]?[380-]{4}\d{2}[-]\d{3}[-]\d{2}[-]\d{2}", "380-67-517-25-54, +38063512s826, 512-582-64")
# print(result)
#
# - email (наявність @, домену: gmail.com наприклад, мінімальна довжина та максимальна на ваш вибір)
# result = re.findall(r"\b[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\.[A-Z|a-z]{2,7}\b", "ka1trin@gmail.com, maryna1sergheyeva-balukh@ukr.net, sota.yopmail.com")
# print(result)
#
# - ПІБ клієнта (3 слова, мінімальна довжина 2 символи, максимальна довжина 20)
# result = re.findall(r"([А-Яа-яЇїІіЄєҐґ]{2,20}+(?:[-][А-Яа-яЇїІіЄєҐґ]{2,20})?\s[А-Яа-яЇїІіЄєҐґ]{2,20}\s[А-Яа-яЇїІіЄєҐґ]{2,20})", "Матвєєва Катерина Юріївна, Сергеєва-Балух Марина Вікторівна, Шлапак Надія")
# print(result)